{
  "family": "mem",
  "datasets": [
    "stream",
    "ramspeed"
  ],
  "vocab_size": 98,
  "oob_id": 99,
  "syscall_to_id": {
    "read": 1,
    "close": 2,
    "open": 3,
    "newstat": 4,
    "mmap": 5,
    "nanosleep": 6,
    "mprotect": 7,
    "newfstat": 8,
    "rt_sigaction": 9,
    "access": 10,
    "munmap": 11,
    "unknown": 12,
    "brk": 13,
    "ioctl": 14,
    "write": 15,
    "getdents": 16,
    "futex": 17,
    "newlstat": 18,
    "fcntl": 19,
    "clone": 20,
    "dup2": 21,
    "lseek": 22,
    "splice": 23,
    "wait4": 24,
    "execve": 25,
    "geteuid": 26,
    "poll": 27,
    "set_robust_list": 28,
    "rt_sigprocmask": 29,
    "sync_file_range": 30,
    "statfs": 31,
    "getpid": 32,
    "getppid": 33,
    "exit_group": 34,
    "compat_unknown": 35,
    "openat": 36,
    "getrlimit": 37,
    "pipe2": 38,
    "set_tid_address": 39,
    "recvmsg": 40,
    "tee": 41,
    "epoll_wait": 42,
    "newfstatat": 43,
    "readlink": 44,
    "pread64": 45,
    "sendmsg": 46,
    "fadvise64": 47,
    "pipe": 48,
    "clock_gettime": 49,
    "writev": 50,
    "getcwd": 51,
    "unlink": 52,
    "select": 53,
    "sched_yield": 54,
    "readv": 55,
    "getuid": 56,
    "newuname": 57,
    "socket": 58,
    "pwrite64": 59,
    "sendto": 60,
    "msync": 61,
    "mincore": 62,
    "epoll_ctl": 63,
    "recvfrom": 64,
    "timerfd_settime": 65,
    "chdir": 66,
    "mremap": 67,
    "getgid": 68,
    "setrlimit": 69,
    "shmat": 70,
    "shmget": 71,
    "mkdir": 72,
    "connect": 73,
    "chmod": 74,
    "ftruncate": 75,
    "shutdown": 76,
    "waitid": 77,
    "symlink": 78,
    "getegid": 79,
    "getsockopt": 80,
    "inotify_add_watch": 81,
    "rmdir": 82,
    "faccessat": 83,
    "prctl": 84,
    "shmdt": 85,
    "flock": 86,
    "getpgrp": 87,
    "mq_timedreceive": 88,
    "eventfd2": 89,
    "rt_sigqueueinfo": 90,
    "accept4": 91,
    "getsockname": 92,
    "sched_getaffinity": 93,
    "lchown": 94,
    "accept": 95,
    "alarm": 96,
    "compat_getdents64": 97,
    "io_getevents": 98
  }
}